/**
 * 문제
 * 2024년, 제14회 아주대학교 프로그래밍 경시대회(이하 2024 APC)가 개최된다! 2024 APC는 두 개의 
 * Division으로 나누어 진행된다.
 * Division 1은 누구나 참여할 수 있으며 수상 시 2024 경인지역 6개 대학 연합 프로그래밍 경시대회
 * (이하 2024 shake!)의 진출권을 얻게 된다.
 * Division 2는 소프트웨어융합대학이나 정보통신대학 소속이 아닌 모두가 참가할 수 있다. 하지만, 
 * 수상을 하더라도 2024 shake!에는 진출할 수 없다.
 * 두 개의 Division을 같이 나갈 수 없다. 다시 말해, Division 1의 참가자와 Division 2의 
 * 참가자는 중복되지 않는다.
 * 각 대회를 우승하게 되면 상금이 주어진다. 
 * 당신은 Division 1을 우승하게 되면 A만원, 
 * Division 2를 우승하게 되면 P만원, 
 * 2024 shake!를 우승하게 되면 C만원을 받게 된다. 
 * 소프트웨어융합대학이나 정보통신대학 소속이 아닌 당신은 어떤 대회라도 나가기만 
 * 하면 우승할 수 있다. 당신이 얻을 수 있는 최대 상금을 구해보자.
 * 
 * 출력
 * 아주대학교 최고의 실력자인 당신이 문제의 조건에 맞게 대회에 출전했을 때 얻을 수 있는 
 * 최대 상금의 액수를 출력한다.
 */
const [A,P,C] = require('fs').readFileSync('./input.txt', 'utf-8').trim().split(' ').map(Number);
const sum = A+C;
console.log(sum > P ? sum : P);